y1s1/cy1601-math-1/module-2a/notes.tex
% Created 2025-04-29 Tue 19:45
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{minted}
\author{Hankertrix}
\date{\today}
\title{Math Module 2A Notes}
\hypersetup{
 pdfauthor={Hankertrix},
 pdftitle={Math Module 2A Notes},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 30.1 (Org mode 9.7.11)}, 
 pdflang={English}}
\begin{document}

\maketitle
\setcounter{tocdepth}{2}
\tableofcontents \clearpage\section{Definitions}
\label{sec:org4909cc5}

\subsection{Diverging to positive infinity}
\label{sec:org89b9298}
Suppose \(a\) is a limit point of the domain \(A\) of \(f\). If for every \(M > 0\), there exists a \(\delta > 0\) such that:
\[0 < |x - a| < \delta, \ \ x \in A \quad \Rightarrow \quad f(x) > M\]

We say that \(f(x)\) \textbf{diverges to positive infinity as \(x\) approaches \(a\)} and write:
\[\lim_{x \rightarrow a} f(x) = + \infty\]
\subsection{Diverging to negative infinity}
\label{sec:org29aae96}
Suppose \(a\) is a limit point of the domain \(A\) of \(f\). If for every \(M > 0\), there exists a \(\delta > 0\) such that:
\[0 < |x - a| < \delta, \ \ x \in A \quad \Rightarrow \quad f(x) < -M\]

We say that \(f(x)\) \textbf{diverges to negative infinity as \(x\) approaches \(a\)} and write:
\[\lim_{x \rightarrow a} f(x) = - \infty\]
\subsection{Limit}
\label{sec:orgd3341d4}
Let \(f : A \rightarrow \mathbb{R}\) be a function and let \(a\) be a limit point of \(A\). If for every \(\varepsilon > 0\), there exists a \(\delta > 0\) such that:
\[0 < |x - a| < \delta, \ \ x \in A \quad \Rightarrow \quad |f(x) - L| < \varepsilon\]
\subsection{The restriction of a function}
\label{sec:org6aa1010}
Consider \(f : A \rightarrow \mathbb{R}\) and suppose \(B \subset A\). The \textbf{restriction of \(f\) to \(B\)}, denoted by \(f \restriction_B\), is the function with domain \(B\) given by:
\[f \restriction_B (x) = f(x), \text{ for } x \in B\]
\subsection{Right-hand limit}
\label{sec:orgd8a5783}
\(\indent\) Consider \(f : A \rightarrow \mathbb{R}\). If the limit below exists:
\[\lim_{x \rightarrow a} f \restriction_{A \cap (a, \infty)}(x)\]

We call it the \textbf{right-hand limit} of \(f\) at \(a\) and denote it using:
\[\lim_{x \rightarrow a+} f(x)\]
\subsection{Left-hand limit}
\label{sec:org3b9d501}
\(\indent\) Consider \(f : A \rightarrow \mathbb{R}\). If the limit below exists:
\[\lim_{x \rightarrow a} f \restriction_{A \cap (-\infty, a)}(x)\]

We call it the \textbf{left-hand limit} of \(f\) at \(a\) and denote it using:
\[\lim_{x \rightarrow a-} f(x)\]
\subsection{Heaviside function}
\label{sec:org274124d}
\[
H(x) = \begin{cases}
0; \quad \text{for } x < 0, \\
1; \quad \text{for } x \ge 0.
\end{cases}
\]
\subsection{Relation between limits and one-sided limits}
\label{sec:org6867927}
Suppose that for some \(\delta > 0\), \(f(x)\) is defined on \((a - \delta, a) \cup (a, a + \delta)\). Then:
\[\lim_{x \rightarrow a} f(x) = L \quad \Leftrightarrow \quad \lim_{x \rightarrow a+} f(x) = L = \lim_{x \rightarrow a-} f(x)\]

\newpage
\subsection{Continuous functions}
\label{sec:orgb8bce00}
A function \(f : A \rightarrow \mathbb{R}\) is \textbf{continuous at \(a \in A\)} if for any \(\varepsilon > 0\) there exists a \(\delta > 0\) such that:
\[|x - a| < \delta, \ \ x \in A \quad \Rightarrow \quad |f(x) - f(a)| < \varepsilon\]

If \(B \subset A\) and \(f\) is continuous at every \(a \in B\), we say that \(f\) is \textbf{continuous} on \(B\).


We say that \(f\) is continuous if \(f\) is continuous on \(A\).
\subsubsection{Theorem}
\label{sec:orgfbc3042}
Consider a function \(f : A \rightarrow \mathbb{R}\) and suppose \(a \in A\) is also a \textbf{limit point of A}. Then \(f\) is continuous at \(a\) if and only if:
\[\lim_{x \rightarrow a} f(x) = f(a)\]

Do note that the criterion \(\lim_{x \rightarrow a} f(x) = f(a)\) includes the condition that the limit \(\lim_{x \rightarrow a} f(x)\) exists. If it doesn't, \(f\) is not continuous at \(a\).
\subsubsection{Notation}
\label{sec:org97c80bc}
The set of functions continuous at a point \(a\) is denoted by \(C(a)\). Hence, \(f \in C(a)\) means that \(f(x)\) is continuous at the point \(a \in \mathbb{R}\). Similarly, \(C(B)\) denotes the set of functions continuous on a set \(B \subset \mathbb{R}\). Another example would be:
\[f \in C([0, 1]) \quad \Leftrightarrow \quad f \text{ is a function that is continuous on } [0, 1]\]
\subsection{Composition rule}
\label{sec:org337183c}
Given two functions \(f(y)\) and \(g(x)\), assume that:
\[\text{1. } \lim_{x \rightarrow a} g(x) = L\]
\[\text{2. } f \in C(L)\]

Then, we would have \(\lim_{x \rightarrow a} f(g(x)) = f(L)\).


In other words, if \(f\) is continuous and \(f\) is continuous at \(\lim_{x \rightarrow a} g(x)\):
\[\lim_{x \rightarrow a} f(g(x)) = f(\lim_{x \rightarrow a} g(x))\]
\subsection{Elementary functions}
\label{sec:orgd05c0c2}
Elementary functions are those functions \(f(x)\) obtained from:
\begin{enumerate}
\item Constants and powers of \(x\)
\item Exponential, logarithm, trigonometric, inverse trigonometric functions
\end{enumerate}

Through addition, subtraction, multiplication, division, power and composition. An example of composition is \(f(g(x))\).


Any elementary function is \textbf{continuous} on its natural domain.
\subsection{Intermediate value theorem}
\label{sec:orgfaf863a}
Assume that \(f \in C([a, b]), f(a) \neq f(b) \text{ and } y_0\) is some real number between \(f(a)\) and \(f(b)\), like:
\[\text{min}\{f(a), f(b)\} < y_0 < \text{max}\{f(a), f(b)\}\]

Then there exists a \(x_0 \in (a, b)\) such that \(f(x_0) = y_0\).


\(f\) must be continuous on the whole \textbf{closed} interval \([a, b]\) for the conclusion to hold. For example, with \(f : [0, 1] \rightarrow \mathbb{R}\), given by:
\[
f(x) = \begin{cases}
1 \quad \text{for } x = 0, \\
-1 \quad \text{for } x \in (0, 1]
\end{cases}
\]

\(f(x)\) is continuous on \((0, 1]\) but not continuous on \([0, 1]\). Since \(y = 0\) is between \(f(0)\) and \(f(1)\), and there is no \(x_0 \in (0, 1)\) such that \(f(x_0) = 0\), the conclusion fails.
\subsection{Max/Min theorem}
\label{sec:org4773dfb}
Assume that \(f \in C([a, b])\). Then there are some points \(x_m, x_M \in [a, b]\) such that for any \(x \in [a, b]\), we have \(f(x_m) \le f(x) \le f(x_M)\).


The result does not hold if we replace \([a, b]\) with \((a, b)\). The function \(f : (0, 1) \rightarrow \mathbb{R}, \ f(x) = x\) is a counterexample.
\subsection{One-to-one functions}
\label{sec:org8157e18}
Consider a function \(f : A \rightarrow \mathbb{R}\). We say that f is \textbf{one-to-one} or \emph{injective} if for \(x_1, x_2 \in A\):
\[x_1 \neq x_2 \quad \Rightarrow \quad f(x_1) \neq f(x_2)\]

Equivalently, we could say that \(f : A \rightarrow \mathbb{R}\) is \textbf{one-to-one} if for \(x_1, x_2 \in A\),
\[f(x_1) = f(x_2) \quad \Rightarrow \quad x_1 = x_2\]

Note that if \(f : A \rightarrow \mathbb{R}\) is one-to-one, then for every \(y \in f(A)\) there exists \textbf{exactly one} \(x \in A\), such that \(f(x) = y\).
\subsection{Inverse functions}
\label{sec:org934b1ee}
Let \(f : A \rightarrow \mathbb{R}\) be a one-to-one functions. The \textbf{inverse} function \(f^{-1} : f(A) \rightarrow \mathbb{R}\) is defined by:
\[f^{-1} (y) = x \quad \Leftrightarrow \quad f(x) = y, \ \ x \in A\]

This definition is usually expressed with the \(x\) and \(y\) swapped:
\[f^{-1} (x) = y \quad \Leftrightarrow \quad f(y) = x, \ \ y \in A\]

Also, note that the \(^{-1}\) in \(f^{-1}\) is \textbf{not} an exponent:
\[f^{-1} (x) \text{ does } \textbf{not } \text{mean } \frac{1}{f(x)}\]

From the definition it also follows that if \(f : A \rightarrow \mathbb{R}\) is one-to-one, then \(g = f^{-1}\) if and only if:
\[\text{1. } g(f(x)) = x, \quad \text{for every } x \in A\]
\[\text{2. } f(g(y)) = y, \quad \text{for every } y \in f(A)\]
\subsubsection{Example 1}
\label{sec:org3548463}
The function \(f : [-\frac{\pi}{2}, \frac{\pi}{2}] \rightarrow \mathbb{R}\) is given by \(f(x) = \sin x\) is one-to-one. Its inverse is called \(\arcsin\). Hence:
\[\arcsin y = x \quad \Leftrightarrow \quad y = \sin x \text{ and } x \in \left[-\frac{\pi}{2}, \frac{\pi}{2} \right]\]
\subsubsection{Example 2}
\label{sec:org77151fd}
The function \(f : [0, \pi] \rightarrow \mathbb{R}\) is given by \(f(x) = \cos x\) is one-to-one. Its inverse is called \(\arccos\). Hence:
\[\arccos y = x \quad \Leftrightarrow \quad y = \cos x \text{ and } x \in [0, \pi]\]
\subsubsection{Example 3}
\label{sec:orgd3d863d}
The function \(f : (-\frac{\pi}{2}, \frac{\pi}{2}) \rightarrow \mathbb{R}\) is given by \(f(x) = \tan x\) is one-to-one. Its inverse is called \(\arctan\). Hence:
\[\arctan y = x \quad \Leftrightarrow \quad y = \tan x \text{ and } x \in \left(-\frac{\pi}{2}, \frac{\pi}{2} \right)\]
\subsubsection{Comment on the examples}
\label{sec:orgc11ce8c}
A lot of textbooks and calculators often use the notation \(\sin^{-1}, \ \cos^{-1}, \ \tan^{-1}\) instead of \(\arcsin, \ \arccos, \ \arctan\) respectively, but this is somewhat misleading since the 3 trigonometric functions themselves are not one-to-one and do not have an inverse.
\subsection{Inverse continuous functions on an interval}
\label{sec:org3befb17}
If \(f : I \rightarrow \mathbb{R}\) is continuous and one-to-one, and if \(I\) is an interval, then \(f^{-1}\) is also continuous.
\subsubsection{Example}
\label{sec:org09ec2c8}
The function \(f : [-\frac{\pi}{2}, \frac{\pi}{2}] \rightarrow \mathbb{R}\) is given by \(f(x) = \sin x\), is one-to-one and continuous.


Since the domain \([-\frac{\pi}{2}, \frac{\pi}{2}]\) is an interval, the inverse function \(\arcsin\) (with domain \([-1, 1]\)) is also continuous.


By similar arguments, the \(\arccos\) and \(\arctan\) functions are also continuous.

\newpage
\section{Linking the limits of functions and sequences}
\label{sec:org89a6cb4}
For \(f : A \rightarrow \mathbb{R}\), assume that \(\lim_{x \rightarrow a} = L\). Then for any sequence \((a_n)\) in \(A\) \textbf{satisfying both conditions:}
\begin{enumerate}
\item For each \(n\), we have \(a_n \neq a\)
\item \(\lim_{n \rightarrow \infty}\)
\end{enumerate}

We have \(\lim_{n \rightarrow \infty} = L\).
\subsection{Proof}
\label{sec:orge2c3823}
Since \(\lim_{x \rightarrow a} f(x) = L\), for any \(\varepsilon > 0\), there is a \(\delta > 0\) such that:
\[0 < |x - a| < \delta, \ x \in A \quad \Rightarrow \quad |f(x) - L| < \varepsilon\]

Since \(a_n \rightarrow a, \ a_n \in A, \ a_n \neq a\), we can find \(N\) such that:
\[n > N \quad \Rightarrow \quad 0 < |a_n - a| < \delta \quad \Rightarrow \quad |f(a_n) - L| < \varepsilon\]

The proof is complete.
\subsection{Contrapositive statement}
\label{sec:org75f3fd3}
Using the theorem we just proved, let's say that we have a function \(f(x)\) and two sequences \((a_n)\) and \((b_n)\), such that:
\[a_n \neq a, \ b_n \neq a, \ \lim_{n \rightarrow \infty} a_n = \lim_{n \rightarrow \infty} = a, \ \lim_{n \rightarrow \infty} f(a_n) \neq \lim_{n \rightarrow \infty} f(b_n)\]

That means that there does not exist any \(L \in \mathbb{R}\) such that:
\[\lim_{x \rightarrow a} f(x) = L\]

Hence, the limit \(\lim_{x \rightarrow a} f(x)\) does not exist. Because if it exists, the theorem tells us that \(\lim_{x \rightarrow \infty} f(a_n) = \lim_{x \rightarrow \infty} f(b_n) = L\).

\newpage
\subsubsection{Example}
\label{sec:org7018eb8}
Let \(f(x) = \sin \frac{1}{x}\). Note that:
\[0 = f(x) = \sin \frac{1}{x} \quad \Leftrightarrow \quad \frac{1}{x} = n\pi, \text{ where } n = \pm 1, \pm 2, \pm 3, \ldots\]
\[1 = f(x) = \sin \frac{1}{x} \quad \Leftrightarrow \quad \frac{1}{x} = \frac{\pi}{2} + 2n\pi, \text{ where } n = 0, \pm 1, \pm 2, \ldots\]

Let \(a_n = \frac{1}{n\pi}\) for n = 1, 2, 3, \(\ldots\). We get \(a_n \neq 0, a_n \rightarrow 0\) as \(n \rightarrow \infty\). Hence:
\[f(a_n) = \sin \frac{1}{a_n} = \sin n\pi = 0\]

So \(\lim_{n \rightarrow \infty} f(a_n) = 0\).


Let \(a_n = \frac{1}{\frac{\pi}{2} + 2n\pi}\) for n = 1, 2, 3, \(\ldots\). We get \(b_n \neq 0, b_n \rightarrow 0\) as \(n \rightarrow \infty\). Hence:
\[f(b_n) = \sin \frac{1}{b_n} = \sin \left( \frac{\pi}{2} + 2n\pi \right) = 1\]

So \(\lim_{n \rightarrow \infty} f(b_n) = 1\).


Since \(\lim_{n \rightarrow \infty} f(a_n) \neq \lim_{n \rightarrow \infty} f(b_n)\), \(\lim_{x \rightarrow 0} f(x)\) does not exist.
\section{Reasoning with limit laws}
\label{sec:org972f5ac}
Suppose \(\lim_{x \rightarrow a} f(x)\) does not exist and \(\lim_{x \rightarrow a} g(x) = L\).


Does \(\lim_{x \rightarrow a} (f(x) + g(x))\) exist?


If for some \(l \in \mathbb{R}\),
\[\lim_{x \rightarrow a} (f(x) + g(x)) = l\]

Then:
\begin{align*}
\lim_{x \rightarrow a} f(x) &= \lim_{x \rightarrow a}[f(x) + g(x) - g(x)] \\
&= l - L \\
&\neq \text{undefined}
\end{align*}

Since \(\lim_{x \rightarrow a} f(x)\) does not exist, \(\lim_{x \rightarrow a} f(x)\) cannot be equal to \(l - L\), which is a contradiction.


Hence, \(\lim_{x \rightarrow a} (f(x) + g(x))\) does not exist.
\end{document}
